In [2]:
import pandas as pd

In [21]:
df=pd.read_excel("Movie.xlsx")

In [22]:
df.head()

   S.no  Movie_Name Ratings
0     1      pathan  3 star
1     2   inception  5 star
2     3     titanic  4 star
3     4   spiderman  4 star
4     5  Tube light  2 star

In [23]:
1 star-1
2 star-2
3 star-3
4 star-4
5 star-5

SyntaxError: invalid syntax (3255508064.py, line 1)

In [24]:
df['Ratings'].value_counts()#returns me count of each category

4 star    2
3 star    1
5 star    1
2 star    1
Name: Ratings, dtype: int64

In [25]:
encode={'Ratings':{"1 star":1,
    "2 star":2,
    "3 star":3,
    "4 star":4,
    "5 star":5}
    
}

In [29]:
encoded_df=df.replace(encode)

In [35]:
encoded_df

   S.no  Movie_Name  Ratings
0     1      pathan        3
1     2   inception        5
2     3     titanic        4
3     4   spiderman        4
4     5  Tube light        2

In [33]:
output=encoded_df.to_excel('data.xlsx')

In [34]:
pd.read_excel('data.xlsx')

   Unnamed: 0  S.no  Movie_Name  Ratings
0           0     1      pathan        3
1           1     2   inception        5
2           2     3     titanic        4
3           3     4   spiderman        4
4           4     5  Tube light        2

In [32]:
df.head(3)

   S.no Movie_Name  Ratings
0     1     pathan        3
1     2  inception        5
2     3    titanic        4

In [32]:
data=pd.read_excel("Movie.xlsx")

In [34]:
data.head(7)

   S.no  Movie_Name Ratings
0     1      pathan  3 star
1     2   inception  5 star
2     3     titanic  4 star
3     4   spiderman  4 star
4     5  Tube light  2 star
5     6      Selfie   2star

In [8]:
type(data['Ratings'])

pandas.core.series.Series

In [16]:
data.dtypes

S.no             int64
Movie_Name      object
Ratings       category
dtype: object

In [14]:
data['Ratings']=data['Ratings'].astype('category')

In [15]:
data.dtypes

S.no             int64
Movie_Name      object
Ratings       category
dtype: object

In [17]:
data['Ratings_new']=data['Ratings'].cat.codes#encoding your categories
#convert my category values from 0 to n
"""
ratings-category
1star
2star-0
3star-1
4star-2
5star-3
"""

In [18]:
data

   S.no  Movie_Name Ratings  Ratings_new
0     1      pathan  3 star            1
1     2   inception  5 star            3
2     3     titanic  4 star            2
3     4   spiderman  4 star            2
4     5  Tube light  2 star            0

In [ ]:
"""
Create a dataset  of home 
-sno. rooms    doors  windows
 1    dinning   two     four
"""

In [19]:
pd.get_dummies(data, columns=['Ratings']).head()
#dummy data- collide, misinterpretedfrom sk

,S.no,Movie_Name,Ratings_new,Ratings_2 star,Ratings_3 star,Ratings_4 star,Ratings_5 star
0,1,pathan,1,0,1,0,0
1,2,inception,3,0,0,0,1
2,3,titanic,2,0,0,1,0
3,4,spiderman,2,0,0,1,0
4,5,Tube light,0,1,0,0,0

In [35]:
from sklearn.preprocessing import OrdinalEncoder

In [36]:
obj=OrdinalEncoder()#creating object of encoder

In [37]:
data['encode']=obj.fit_transform(data[['Ratings']])

In [39]:
data.head(7)

   S.no  Movie_Name Ratings  encode
0     1      pathan  3 star     2.0
1     2   inception  5 star     4.0
2     3     titanic  4 star     3.0
3     4   spiderman  4 star     3.0
4     5  Tube light  2 star     0.0
5     6      Selfie   2star     1.0

In [26]:
data.value_counts

<bound method DataFrame.value_counts of    S.no  Movie_Name Ratings  Ratings_new  encode
0     1      pathan  3 star            1     1.0
1     2   inception  5 star            3     3.0
2     3     titanic  4 star            2     2.0
3     4   spiderman  4 star            2     2.0
4     5  Tube light  2 star            0     0.0>